In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\amitm\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\amitm\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\amitm\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\amitm\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\amitm\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\amitm\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd  #aliase

In [5]:
a = (1,2,3,4,5,6)

b = ["one","two","three","four","five","six"] 

#dtype=int

x = pd.Series(data = b)
x

0      one
1      two
2    three
3     four
4     five
5      six
dtype: object

In [6]:
y = pd.Series(data = a, index=b, dtype= str)
y

one      1
two      2
three    3
four     4
five     5
six      6
dtype: object

In [7]:
z = pd.Series(data = b, index=a, dtype= str)
z

1      one
2      two
3    three
4     four
5     five
6      six
dtype: object

In [10]:
#Series from list
a = [1,2,3,4]
b = ("I","II","III","IV")
s = pd.Series(data = a, index= b ,dtype=int)
s

I      1
II     2
III    3
IV     4
dtype: int32

In [12]:
s.index

Index(['I', 'II', 'III', 'IV'], dtype='object')

In [13]:
s['III']

3

In [14]:
data = pd.Series([1,2,3,4.6])
data

0    1.0
1    2.0
2    3.0
3    4.6
dtype: float64

In [15]:
data[::-1]

3    4.6
2    3.0
1    2.0
0    1.0
dtype: float64

In [16]:
data[-2] ## NEGATIVE INDEX DOESNT WORK HERE

KeyError: -2

In [17]:
a = [1,2,3,4]

In [18]:
a[-2]

3

In [19]:
data[2:4]

2    3.0
3    4.6
dtype: float64

In [20]:
emp ={"A":8,"B":9,"C":10}

details= pd.Series(emp)

details

A     8
B     9
C    10
dtype: int64

In [21]:
#changing order of index
age = {'ram' : 28,'bob' : 19, 'cam' : 22}

s = pd.Series(data= age, index=['bob','ram','cam',"hello"],dtype=int)
s

bob      19.0
ram      28.0
cam      22.0
hello     NaN
dtype: float64

In [22]:
population_dict ={'California':38332521,
                 'Texas':26448193,
                 'New York':19651127,
                 'Florida':19562860,
                 'Florida':19662860,
                 'Illinois':12882135,
                 'Illinois':12892135}
population_series = pd.Series(population_dict)
population_series

California    38332521
Texas         26448193
New York      19651127
Florida       19662860
Illinois      12892135
dtype: int64

In [23]:
population_series['Texas':'Illinois']

Texas       26448193
New York    19651127
Florida     19662860
Illinois    12892135
dtype: int64

In [24]:
population_dict.keys()

dict_keys(['California', 'Texas', 'New York', 'Florida', 'Illinois'])

In [25]:
population_dict.values()

dict_values([38332521, 26448193, 19651127, 19662860, 12892135])

In [26]:
population_series['New York']

19651127

In [27]:
pd.Series([2,3,4])

0    2
1    3
2    4
dtype: int64

In [28]:
area_dict = {'California':423967,
            'Texas':695662,
            'New York':141297,
            'Florida':170312,
            'Illinois':149995}
area_series = pd.Series(area_dict) 
area_series

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [29]:
states = pd.DataFrame({'population':population_series,
                      'area':area_series})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19662860  170312
Illinois      12892135  149995

In [30]:
data = [["A",34,23,56],["B",92,88,76],["C",76," ",25],["D"," ",78,99]]

stu = pd.DataFrame(data, columns=["Name",'Maths','Phy','Chem'],index=[1,2,3,4])
stu

  Name Maths Phy  Chem
1    A    34  23    56
2    B    92  88    76
3    C    76        25
4    D        78    99

In [31]:
stu["Phy"]

1    23
2    88
3
4    78
Name: Phy, dtype: object

In [32]:
type(stu)

pandas.core.frame.DataFrame

In [33]:
type(stu["Phy"])

pandas.core.series.Series

In [34]:
stu["Phy", "Maths"]

KeyError: ('Phy', 'Maths')

In [37]:
stu[["Phy", "Maths", "Chem"]]

  Phy Maths  Chem
1  23    34    56
2  88    92    76
3        76    25
4  78          99

In [38]:
#series = 1D
#Dataframe = 2D

In [39]:
stu["Name"]

1    A
2    B
3    C
4    D
Name: Name, dtype: object

In [40]:
stu["Phy"]

1    23
2    88
3
4    78
Name: Phy, dtype: object

In [41]:
stu.replace(" ",0)

  Name  Maths  Phy  Chem
1    A     34   23    56
2    B     92   88    76
3    C     76    0    25
4    D      0   78    99

In [42]:
# Selecting Columns
d = {'Chem' : pd.Series([30, 70, 35,25,26,67,77,67,89], index=["Raj",'Ram', 'Asa', 'Pi','Chi','Ru',"Sita","Ria","Gita"],dtype=int),
     'Math' : pd.Series([18, 26, 35, 40,55,89,79,100], index=["Raj",'Ram', 'Pi', 'Chi', 'Ru',"Sita","Ria","Gita"],dtype=int),
     'Phy' : pd.Series([31, 42, 83,34,80,78], index=["Asa",'Ram', 'Pi', 'Ru',"Sita","Gita"],dtype=int)}



exam = pd.DataFrame(d)
exam1=exam.copy() ## To make copy of your data
exam1

      Chem   Math   Phy
Asa     35    NaN  31.0
Chi     26   40.0   NaN
Gita    89  100.0  78.0
Pi      25   35.0  83.0
Raj     30   18.0   NaN
Ram     70   26.0  42.0
Ria     67   79.0   NaN
Ru      67   55.0  34.0
Sita    77   89.0  80.0

In [43]:
print ("Adding a new column using the existing columns in DataFrame:")

exam1['Total'] = exam1['Chem']+exam1['Math']+exam1['Phy']
exam1

Adding a new column using the existing columns in DataFrame:

      Chem   Math   Phy  Total
Asa     35    NaN  31.0    NaN
Chi     26   40.0   NaN    NaN
Gita    89  100.0  78.0  267.0
Pi      25   35.0  83.0  143.0
Raj     30   18.0   NaN    NaN
Ram     70   26.0  42.0  138.0
Ria     67   79.0   NaN    NaN
Ru      67   55.0  34.0  156.0
Sita    77   89.0  80.0  246.0

In [44]:
exam1.isnull().sum()

Chem     0
Math     1
Phy      3
Total    4
dtype: int64

In [45]:
exam1.fillna(0)

      Chem   Math   Phy  Total
Asa     35    0.0  31.0    0.0
Chi     26   40.0   0.0    0.0
Gita    89  100.0  78.0  267.0
Pi      25   35.0  83.0  143.0
Raj     30   18.0   0.0    0.0
Ram     70   26.0  42.0  138.0
Ria     67   79.0   0.0    0.0
Ru      67   55.0  34.0  156.0
Sita    77   89.0  80.0  246.0

In [46]:
exam1["Avg"] = (exam1["Math"] + exam1["Phy"] + exam1["Chem"])/3
exam1

      Chem   Math   Phy  Total        Avg
Asa     35    NaN  31.0    NaN        NaN
Chi     26   40.0   NaN    NaN        NaN
Gita    89  100.0  78.0  267.0  89.000000
Pi      25   35.0  83.0  143.0  47.666667
Raj     30   18.0   NaN    NaN        NaN
Ram     70   26.0  42.0  138.0  46.000000
Ria     67   79.0   NaN    NaN        NaN
Ru      67   55.0  34.0  156.0  52.000000
Sita    77   89.0  80.0  246.0  82.000000

In [47]:
a = exam1["Math"].median()
a
exam1["Math"] = exam1["Math"].fillna(a)

In [48]:
exam1

      Chem   Math   Phy  Total        Avg
Asa     35   47.5  31.0    NaN        NaN
Chi     26   40.0   NaN    NaN        NaN
Gita    89  100.0  78.0  267.0  89.000000
Pi      25   35.0  83.0  143.0  47.666667
Raj     30   18.0   NaN    NaN        NaN
Ram     70   26.0  42.0  138.0  46.000000
Ria     67   79.0   NaN    NaN        NaN
Ru      67   55.0  34.0  156.0  52.000000
Sita    77   89.0  80.0  246.0  82.000000

In [50]:
exam1["Chem"].median()

67.0

In [51]:
b=exam1["Phy"].median()
b
exam1["Phy"] = exam1["Phy"].fillna(b)

exam1

      Chem   Math   Phy  Total        Avg
Asa     35   47.5  31.0    NaN        NaN
Chi     26   40.0  60.0    NaN        NaN
Gita    89  100.0  78.0  267.0  89.000000
Pi      25   35.0  83.0  143.0  47.666667
Raj     30   18.0  60.0    NaN        NaN
Ram     70   26.0  42.0  138.0  46.000000
Ria     67   79.0  60.0    NaN        NaN
Ru      67   55.0  34.0  156.0  52.000000
Sita    77   89.0  80.0  246.0  82.000000

In [52]:
exam1["Total_Cleaned"] = exam1["Math"]+exam1["Phy"]+exam1["Chem"]
exam1

      Chem   Math   Phy  Total        Avg  Total_Cleaned
Asa     35   47.5  31.0    NaN        NaN          113.5
Chi     26   40.0  60.0    NaN        NaN          126.0
Gita    89  100.0  78.0  267.0  89.000000          267.0
Pi      25   35.0  83.0  143.0  47.666667          143.0
Raj     30   18.0  60.0    NaN        NaN          108.0
Ram     70   26.0  42.0  138.0  46.000000          138.0
Ria     67   79.0  60.0    NaN        NaN          206.0
Ru      67   55.0  34.0  156.0  52.000000          156.0
Sita    77   89.0  80.0  246.0  82.000000          246.0

In [53]:
exam1
exam1=exam1.dropna()

In [54]:
exam1

      Chem   Math   Phy  Total        Avg  Total_Cleaned
Gita    89  100.0  78.0  267.0  89.000000          267.0
Pi      25   35.0  83.0  143.0  47.666667          143.0
Ram     70   26.0  42.0  138.0  46.000000          138.0
Ru      67   55.0  34.0  156.0  52.000000          156.0
Sita    77   89.0  80.0  246.0  82.000000          246.0

In [55]:
exam1.drop(["Total"], axis = 1 )

      Chem   Math   Phy        Avg  Total_Cleaned
Gita    89  100.0  78.0  89.000000          267.0
Pi      25   35.0  83.0  47.666667          143.0
Ram     70   26.0  42.0  46.000000          138.0
Ru      67   55.0  34.0  52.000000          156.0
Sita    77   89.0  80.0  82.000000          246.0

In [56]:
exam1.drop(["Avg"], axis = 1 )

      Chem   Math   Phy  Total  Total_Cleaned
Gita    89  100.0  78.0  267.0          267.0
Pi      25   35.0  83.0  143.0          143.0
Ram     70   26.0  42.0  138.0          138.0
Ru      67   55.0  34.0  156.0          156.0
Sita    77   89.0  80.0  246.0          246.0

In [57]:
exam1

      Chem   Math   Phy  Total        Avg  Total_Cleaned
Gita    89  100.0  78.0  267.0  89.000000          267.0
Pi      25   35.0  83.0  143.0  47.666667          143.0
Ram     70   26.0  42.0  138.0  46.000000          138.0
Ru      67   55.0  34.0  156.0  52.000000          156.0
Sita    77   89.0  80.0  246.0  82.000000          246.0

In [58]:
exam1.drop(["Total"], axis = 1, inplace = True )

C:\Users\amitm\AppData\Local\Temp\ipykernel_12656\4236112712.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  exam1.drop(["Total"], axis = 1, inplace=True )

In [59]:
exam1

      Chem   Math   Phy        Avg  Total_Cleaned
Gita    89  100.0  78.0  89.000000          267.0
Pi      25   35.0  83.0  47.666667          143.0
Ram     70   26.0  42.0  46.000000          138.0
Ru      67   55.0  34.0  52.000000          156.0
Sita    77   89.0  80.0  82.000000          246.0

In [60]:
df = pd.DataFrame({'one':[10,20,30,40,50,"ABC"], 'AGE':[-19,1,30,40,50,60]})
df

   one  AGE
0   10  -19
1   20    1
2   30   30
3   40   40
4   50   50
5  ABC   60

In [61]:
df_cleaned = df.replace({"ABC":60,-19:19})
df_cleaned

   one  AGE
0   10   19
1   20    1
2   30   30
3   40   40
4   50   50
5   60   60

In [62]:
details = {'Brand':pd.Series(['Nokia','Asus',"Nokia","Nokia",'Samsung',"ABC",'Micromax','Apple','MI','Zen',"Apple"]),
   'Price':pd.Series([10000,8000,12500,7000,40000,12000,12999,13999,59999]),
   'Rating(10)':pd.Series([7,6.5,8.5,9,8,9.5,7,9])
}

d = pd.DataFrame(details)
d

       Brand    Price  Rating(10)
0      Nokia  10000.0         7.0
1       Asus   8000.0         6.5
2      Nokia  12500.0         8.5
3      Nokia   7000.0         9.0
4    Samsung  40000.0         8.0
5        ABC  12000.0         9.5
6   Micromax  12999.0         7.0
7      Apple  13999.0         9.0
8         MI  59999.0         NaN
9        Zen      NaN         NaN
10     Apple      NaN         NaN

In [65]:
dm =d["Price"].mean()

In [64]:
d["Rating(10)"].mean()

8.0625

In [67]:
d["Price"].fillna(dm )

0     10000.000000
1      8000.000000
2     12500.000000
3      7000.000000
4     40000.000000
5     12000.000000
6     12999.000000
7     13999.000000
8     59999.000000
9     19610.777778
10    19610.777778
Name: Price, dtype: float64